spec/fixtures/services/ad_group_service/mutate_add-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v200909/AdGroupService' -->
<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns="https://adwords.google.com/api/adwords/cm/v200909"
  xmlns:s="https://adwords.google.com/api/adwords/cm/v200909">
    <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
      <authToken>***censured***</authToken>
      <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
      <developerToken>***censured***</developerToken>
  <clientEmail>client_1+sem4ruby@gmail.com</clientEmail>
  </s:RequestHeader>
  </env:Header>
  <env:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/v200909">
      <operations xsi:type="AdGroupOperation">
        <operator>ADD</operator>
        <operand>
          <campaignId>62748</campaignId>
          <name>adgroup dsl 2010-02-13 09:40:02 +0100</name>
          <status>ENABLED</status>
          <bids xsi:type="ManualCPCAdGroupBids">
            <keywordMaxCpc>
              <amount xsi:type="Money">
                <microAmount>10000000</microAmount>
              </amount>
            </keywordMaxCpc>
          </bids>
        </operand>
      </operations>
    </mutate>
  </env:Body>
</env:Envelope>

